<a href="https://colab.research.google.com/github/mrsyamhfis/DataSummary_Python_Pandas/blob/main/Assigment_Chapter_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importing dataset

In [1]:
import pandas as pd
top_uni = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Top 2000 Universities of the World.csv")

Exploring dataset

In [2]:
top_uni

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1.0,1.0,1.0,1.0,100.0
1,2,Massachusetts Institute of Technology,USA,2,4.0,12.0,2.0,8.0,96.7
2,3,Stanford University,USA,3,10.0,4.0,3.0,2.0,95.1
3,4,University of Cambridge,United Kingdom,1,3.0,25.0,4.0,10.0,94.1
4,5,University of Oxford,United Kingdom,2,7.0,27.0,9.0,4.0,93.3
...,...,...,...,...,...,...,...,...,...
1995,1996,Santa Catarina State University,Brazil,56,0.0,936.0,0.0,1938.0,65.8
1996,1997,Yancheng Institute of Technology,China,275,0.0,0.0,0.0,1920.0,65.7
1997,1998,Xi'an University of Science and Technology,China,276,0.0,994.0,0.0,1937.0,65.7
1998,1999,CEU San Pablo University,Spain,53,0.0,568.0,0.0,1992.0,65.7
1999,2000,Huzhou University,China,277,0.0,0.0,0.0,1922.0,65.7

In [3]:
top_uni.shape

(2000, 9)

In [4]:
top_uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   World Rank                 2000 non-null   int64
 1   Institution                2000 non-null   object
 2   Country                    2000 non-null   object
 3   National Rank              2000 non-null   int64
 4   Quality of Education Rank  2000 non-null   float64
 5   Alumni Employment Rank     2000 non-null   float64
 6   Quality of Faculty Rank    2000 non-null   float64
 7   Research Performance Rank  2000 non-null   float64
 8   Score                      2000 non-null   float64
dtypes: float64(5), int64(2), object(2)
memory usage: 140.8+ KB

**Question 1**

In [5]:
top_uni.isnull().sum()

World Rank                   0
Institution                  0
Country                      0
National Rank                0
Quality of Education Rank    0
Alumni Employment Rank       0
Quality of Faculty Rank      0
Research Performance Rank    0
Score                        0
dtype: int64

Google Sheets shows there is null values in the dataset. But in here, the null values are tagged as '0.0'. Thus, null values are unidentified. So need to remove these null values some other way.

In [6]:
all_null = (top_uni == 0.0)

Total number of null values for each column:

In [7]:
all_null.sum()

World Rank                      0
Institution                     0
Country                         0
National Rank                   0
Quality of Education Rank    1572
Alumni Employment Rank       1025
Quality of Faculty Rank      1731
Research Performance Rank      64
Score                           0
dtype: int64

In [8]:
all_null.sum().sum()

4392

# Need to drop all the rows with null

Unsuccessful attempts:

*   top_uni.allnull.drop(inplace = True, axis=1)
*   top_uni.drop(all_null['Quality of Education'],axis=1, inplace=True)
*   top_uni.drop(only_null, inplace=True, axis=1)

In [9]:
#below was copied from this:
#indexAge = df[ (df['Name'] == 'John Holland') | (df['Position'] == 'SG') ].index
#df.drop(indexAge , inplace=True)
#df.head(15)

In [10]:
only_null = top_uni[ (top_uni['Quality of Education Rank'] == 0.0) | (top_uni['Alumni Employment Rank'] == 0.0) | (top_uni['Quality of Faculty Rank'] == 0.0) ].index

In [11]:
top_uni.drop(only_null , inplace=True)

check ada null values lagi ke tak ðŸ˜¥

In [12]:
check_null = (top_uni == 0.0)

In [13]:
check_null.sum()

World Rank                   0
Institution                  0
Country                      0
National Rank                0
Quality of Education Rank    0
Alumni Employment Rank       0
Quality of Faculty Rank      0
Research Performance Rank    2
Score                        0
dtype: int64

check apa null values for Research Performance Rank

In [14]:
print(top_uni['Research Performance Rank'])

0          1.0
1          8.0
2          2.0
3         10.0
4          4.0
         ...
729      776.0
836      865.0
927        0.0
958        0.0
1096    1183.0
Name: Research Performance Rank, Length: 183, dtype: float64

**Question 2**

In [15]:
top_uni.describe()

,World Rank,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000
mean,160.071038,23.464481,209.737705,432.852459,121.114754,175.579235,81.819126
std,177.948907,33.974903,155.166012,368.807322,76.098136,185.434574,5.030393
min,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,69.700000
25%,50.500000,4.000000,77.500000,120.000000,57.000000,54.500000,78.800000
50%,113.000000,10.000000,172.000000,371.000000,116.000000,131.000000,81.200000
75%,194.500000,30.500000,334.000000,614.000000,179.500000,234.500000,84.550000
max,1097.000000,214.000000,522.000000,1498.000000,273.000000,1183.000000,100.000000

**Question 4**

In [16]:
Alumni_null = top_uni["Alumni Employment Rank"] == 0.0

The total number of null values in column "Alumni Employment Rank"

In [17]:
Alumni_null.sum()

0

In [18]:
sorted_q4 = top_uni.sort_values(by=['Alumni Employment Rank'], ascending=True).head(10)

In [19]:
sorted_q4

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1.0,1.0,1.0,1.0,100.0
2,3,Stanford University,USA,3,10.0,4.0,3.0,2.0,95.1
12,13,University of Tokyo,Japan,1,39.0,6.0,107.0,27.0,89.8
40,41,Institut Polytechnique de Paris,France,4,100.0,8.0,219.0,316.0,85.4
8,9,University of Pennsylvania,USA,7,14.0,10.0,42.0,12.0,91.1
1,2,Massachusetts Institute of Technology,USA,2,4.0,12.0,2.0,8.0,96.7
6,7,Columbia University,USA,5,11.0,14.0,10.0,15.0,92.0
5,6,Princeton University,USA,4,5.0,15.0,7.0,70.0,92.6
7,8,University of Chicago,USA,6,8.0,16.0,27.0,22.0,91.5
39,40,Dartmouth College,USA,25,53.0,17.0,95.0,273.0,85.5

In [20]:
print(sorted_q4["Country"].nunique())
print(sorted_q4["Country"].unique())

3
['USA' 'Japan' 'France']

**Question 5**

In [21]:
filter_uni = top_uni.filter(['World Rank','Score','Institution'])

In [22]:
#incorrect
#Uni_USA = filter_uni.filter["Country" == USA]
#Uni_USA = filter_uni.filter["Country" == 'USA']
#Uni_USA = filter_uni.filter["Country"] == 'USA'
#Uni_USA = filter_uni["Country"] == 'USA'
#Uni_USA = filter_uni["Country"] == USA
#That works:
#df[df.maker == 'skoda']

In [23]:
filter_uni[top_uni.Country == 'USA']

     World Rank  Score                            Institution
0             1  100.0                     Harvard University
1             2   96.7  Massachusetts Institute of Technology
2             3   95.1                    Stanford University
5             6   92.6                   Princeton University
6             7   92.0                    Columbia University
..          ...    ...                                    ...
402         403   75.2             University at Albany, SUNY
652         653   72.7                  Binghamton University
679         680   72.5             University of Maine, Orono
927         928   70.7                  Pepperdine University
958         959   70.5                         Pomona College

[69 rows x 3 columns]

**Question 6**

In [24]:
grouped_uni = top_uni.groupby('Country')

In [25]:
grouped_uni.mean()

,World Rank,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
Country,,,,,,,
Australia,113.250000,4.000000,236.000000,574.750000,161.250000,90.250000,81.425000
Austria,385.000000,4.000000,294.000000,837.500000,160.000000,466.000000,76.000000
Belgium,170.000000,3.000000,390.000000,459.000000,183.000000,163.000000,79.550000
Brazil,105.000000,1.000000,518.000000,333.000000,131.000000,85.000000,81.500000
Canada,131.625000,5.625000,298.500000,403.625000,120.125000,128.000000,82.025000
China,187.000000,12.000000,388.000000,1241.000000,246.000000,144.000000,79.000000
Denmark,113.333333,2.000000,235.000000,476.000000,128.000000,99.666667,82.033333
Finland,118.000000,1.000000,202.000000,913.000000,167.000000,88.000000,81.000000
France,92.875000,5.750000,191.125000,545.375000,121.500000,137.500000,83.537500
Germany,141.928571,9.785714,167.214286,728.571429,119.000000,163.285714,80.828571
India,1097.000000,20.000000,521.000000,591.000000,249.000000,1183.000000,69.700000
Ireland,218.000000,1.000000,206.000000,83.000000,242.000000,286.000000,78.300000
Israel,112.500000,2.500000,69.500000,388.500000,49.500000,216.000000,81.650000
Italy,277.600000,9.200000,421.400000,757.200000,173.600000,305.400000,77.400000
Japan,107.428571,4.714286,166.714286,119.571429,107.571429,151.571429,82.671429
Mexico,287.000000,1.000000,397.000000,1462.000000,240.000000,270.000000,76.900000
Netherlands,105.000000,3.800000,239.600000,755.800000,152.200000,84.400000,81.740000
New Zealand,516.000000,3.000000,355.000000,425.000000,241.000000,553.000000,74.000000
Norway,129.500000,1.500000,174.000000,595.500000,67.000000,183.000000,81.000000
Poland,837.000000,7.000000,469.000000,1367.000000,260.000000,865.000000,71.300000
Portugal,201.000000,1.000000,428.000000,1204.000000,236.000000,169.000000,78.600000
Russia,368.000000,4.500000,137.500000,492.500000,232.500000,391.000000,76.250000
South Korea,31.000000,1.000000,315.000000,21.000000,135.000000,58.000000,86.500000
Spain,247.000000,3.000000,200.000000,166.000000,220.000000,280.000000,77.700000
Sweden,137.200000,4.000000,229.400000,344.200000,149.800000,154.800000,80.480000
Switzerland,104.166667,3.833333,113.166667,541.666667,93.000000,120.333333,82.183333
USA,133.753623,48.507246,180.739130,263.898551,97.869565,137.768116,83.571014
United Kingdom,190.642857,16.928571,199.178571,455.678571,119.392857,222.500000,80.903571

Accidently deleted all 'Pakistan' uni â¬†

**Question 7**

2.

In [27]:
print("Maximum score =", top_uni["Score"].max())
print("Minimum score =", top_uni["Score"].min())

Maximum score = 100.0
Minimum score = 69.7

3.

In [28]:
top_uni["Score"].quantile([0.25,0.75])

0.25    78.80
0.75    84.55
Name: Score, dtype: float64

In [29]:
q1, q3 = top_uni["Score"].quantile([0.25,0.75])

In [30]:
print(q1, q3)

78.8 84.55

In [31]:
iqr = q3 - q1

In [32]:
print(iqr)

5.75

4.

In [33]:
lower_min = q1 - (1.5*iqr)
upper_max = q3 + (1.5*iqr)

In [34]:
print(lower_min, upper_max)

70.175 93.175

5.

In [36]:
top_uni[(top_uni["Score"] < 70.175) | (top_uni["Score"] > 93.175)]

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1.0,1.0,1.0,1.0,100.0
1,2,Massachusetts Institute of Technology,USA,2,4.0,12.0,2.0,8.0,96.7
2,3,Stanford University,USA,3,10.0,4.0,3.0,2.0,95.1
3,4,University of Cambridge,United Kingdom,1,3.0,25.0,4.0,10.0,94.1
4,5,University of Oxford,United Kingdom,2,7.0,27.0,9.0,4.0,93.3
1096,1097,University of Calcutta,India,20,521.0,591.0,249.0,1183.0,69.7